[
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "10:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Programando Coletivamente o Encontros Digitais",
    "proponente": "Carlos de Oliveira Junior (Vamoss)",
    "descricao": "Esse é um esforço coletivo para adicionar/alterar/corrigir funcionalidades no Encontros Digitais. Nesta atividade vamos aprender como instalar o Encontros Digitais para rodar no seu computador. A partir disso, vamos aprender como alterar o código e enviar contribuições para melhorar a plataforma.",
    "publico": "todos os públicos",
    "vagas": "100",
    "requisitos": "O processo de instalação do Encontros Digitais está descrito aqui:\nhttps://github.com/EncontrosDigitais/bootcamp/wiki/Instalando-e-executando-o-Bootcamp\n\nÉ necessário ter uma conta no Github e um computador capaz de rodar os softwares descritos no link acima",
    "minibio": "Vamoss é programador criativo e Diretor de Tecnologia na SuperUber desde 2011. Ele integra conteúdo, hardware, software, design e arquitetura para desenvolver projetos únicos. Graduado em Design pela ESPM-Rio, trabalha com mídia interativa desde 2004, desenvolvendo projetos para espaços físicos, celular e web. Ele está fazendo o Mestrado em Economia Criativa na ESPM-Rio, onde se engajou com a comunidade de programação criativa no Brasil para criar o EncontrosDigitais.com.br, uma plataforma colaborativa para compartilhar conhecimento entre programadores criativos e a sociedade.",
    "foto": "https://drive.google.com/file/d/1v2Ok3hzyl-I9QbXNT8mN6YQZ8bo1WY_Y/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MzZ0bm03N25qdGsyaWN0bnJub3U5ZjdsaHEgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "10:00",
    "duracao": "1 hora",
    "tipo": "palestra",
    "titulo": "Design Generativo de Superfícies",
    "proponente": "Gustavo Mandolesi",
    "descricao": "Uma visão geral do uso de Processing no desenvolvimento de padronagens geométricas para Design de Superfícies e as possibilidades em Arte Generativa.",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": "Curiosidade",
    "minibio": "Engenheiro com 20 anos de experiência na indústria de software, utiliza Processing desde 2007 em projetos profissionais e pessoais. Entusiasta de Arte e Design, vem há alguns anos pesquisando e desenvolvendo sistemas para geração parametrizada de padronagens geométricas.",
    "foto": "https://media-exp1.licdn.com/dms/image/C4D03AQHpw0CA6Y8j4g/profile-displayphoto-shrink_200_200/0/1516236064593?e=1620259200&v=beta&t=iKBmhBPlFzZGxku5I7t3igi5IRPZHhD09cK_LnnaW7c",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MDZpZnMxb3N0djQ4OWNpanFqMzBvdDZhcmkgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "14:00",
    "duracao": "3 horas",
    "tipo": "workshop",
    "titulo": "Oficina introdutória de Processing modo Python",
    "proponente": "Alexandre Villares",
    "descricao": "O objetivo desta oficina é introduzir as pessoas participantes à programação criativa com Processing no modo Python (py.processing.org).      \nProcessing é um ecossistema de ferramentas e ideias para a chamada \"programação criativa\", com foco em tornar a programação acessível e inclusiva para artistas, designers, educadores e iniciantes de um modo geral. O Processing modo Python acrescenta a este ecossistema a sintaxe amigável de Python. \n\nAlguns dos assuntos tratados nesta rápida introdução.\n- Vocabulário básico de desenho e atributos gráficos;\n- Primeiros passos com variáveis;\n- Execução condicional (if);\n- Sequencias de números e laços de repetição (loops).",
    "publico": "iniciantes",
    "vagas": "100",
    "requisitos": "Não tem pré-requisitos, as pessoas participantes devem ter acesso a um computador pessoal com um navegador moderno (i.e. Chrome) e uma conexão de Internet que permita participar de uma vídeo-chamada. Devem instalar previamente o Processing com o Modo Python. Instruções para instalar o Processing com o modo Python: https://abav.lugaralgum.com/como-instalar-o-processing-modo-python/ Em caso de dificuldade com esta instalação poderá ser usada uma ferramenta online (no navegador) com a maior parte das funcionalidades.",
    "minibio": "Professor, artista visual e consultor em projetos de design e novas mídias. Pesquisa práticas artísticas que se valem de meios computacionais e o ensino de programação em contextos visuais. Graduado em arquitetura e urbanismo pela FAU-USP (2000) e mestre pela FEC-Unicamp (2019). Apoiador da Processing Foundation e co-organizador da Noite de Processing em São Paulo. Ministra cursos na graduação e na pós-graduação de diversas instituições, desenvolve também cursos e oficinas independentes ou como educador de tecnologias e artes no Sesc-SP.",
    "foto": "https://res.cloudinary.com/practicaldev/image/fetch/s--TgmrGTLi--/c_fill,f_auto,fl_progressive,h_320,q_auto,w_320/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/191712/fa2e7fb6-2bfb-4421-92a5-6ebd5be9240e.jpeg",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MDZjbWcwY3Vyc2licnVvNGJibXUxNGNzbW4gcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "14:00",
    "duracao": "1 hora",
    "tipo": "palestra",
    "titulo": "Arte Codificada – Encerramento",
    "proponente": "Zimaldo Melo (Bactéria) e Jarbas Jácome",
    "descricao": "Live com o arte-programador e músico Jarbas Jácome, como encerramento da Web Oficina Arte Codificada, projeto contemplado pela Lei de Incentivo Aldir Blanc Bahia. A web oficina será composta de 5 vídeos publicados semanalmente entre 04 de março e 04 de Abril de 2021 e de duas lives, sendo a primeira programada para o dia 5 de março com o designer e arte-programador Tony de Marco. A ideia é encerrar a Web Oficina com a live de Jarbas Jácome, durante a programação do PCD. \nNa live com Jarbas Jácome serão abordados temas como estruturação e organização do código, poéticas tipográficas/textuais e o projeto de pesquisa que ele está desenvolvendo no doutorado pela UFPE, TextoTecidoPalavras.",
    "publico": "programadores com alguma prática e experientes",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Graduado pelo curso de Bacharelado em Artes Visuais da Universidade Federal do Recôncavo da Bahia - UFRB em 2014, realiza experiências com pintura, gravura, arte e tecnologia e performance buscando sempre estimular a participação do público através de uma poética participativa, utilizando desde tesouras até código computacional. Seus trabalhos podem ser vistos em bacteria.com.br.",
    "foto": "https://drive.google.com/file/d/1YA1vTjHyRUQDWmTKIihufV4k5iqg_EFc/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NGhrN2MycHAwM2Q4OW82aWdoMTdmMW5qMzcgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "15:30",
    "duracao": "1 hora",
    "tipo": "palestra",
    "titulo": "Arte e tecnologia nas Universidades: Presença da programação criativa em grupos de pesquisa da USP e UNESP ( 2010-2021).",
    "proponente": "Bruna Mayer, Miguel Alonso & Rodrigo Rezende",
    "descricao": "Processing, arduino, softwares livres, programações criativas, prototipagem e práticas artísticas/poéticas com a tecnologia estão presentes também nas universidades e nos cursos de artes visuais de graduação e pós graduação. Apresentaremos esse contexto a partir das experiências com os Grupos de Pesquisa Realidades (USP, coordenado por Silvia Laurentiz, http://www2.eca.usp.br/realidades/pt/) e GIIP (UNESP, coordenado por Rosangella Leote e Fernanda Duarte, https://giippesquisa.wixsite.com/giip), comentando os processos criativos e colaborativos dos dois grupos e comentando as exposições realizadas, com uma natureza interinstitucional e interdisciplinar.",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Bruna Mayer é mestranda pelo Programa de Pós-Graduação em Artes Visuais (PPGAV) da Escola de Comunicações e Artes da USP (PPGAV/ECA-USP), sob orientação da Profª Drª Silvia Regina Ferreira de Laurentiz. É bacharela em Artes Visuais/Multimídia pela USP (2019). Está pesquisando instalações interativas tecnológicas. Integra o Coletivo Bruthale e o Grupo de Pesquisa Realidades (ECA/USP). <brunamayercosta@gmail.com>\n\nMiguel Alonso: Artista plástico, professor e educador de tecnologias e artes do Sesc SP (unidade Guarulhos). Doutorando pelo PPGAV - ECA/USP. Mestre pelo PPG em Artes da UNESP. Formado em bacharelado e em licenciatura em Artes Visuais na UNESP. Membro dos Grupos de Pesquisa Realidades (ECA/USP) e GIIP (IA/UNESP). <miguelalonso@usp.br>\n\nRodrigo Rezende é mestrando em Artes Visuais na Unesp. Atua como Artista no Coletivo RE(C)organize e desenvolve pesquisas com software e hardware livres. Atua como multiplicador de conhecimento, através de oficinas nas áreas de multimídia, arte computacional e audiovisual, além de desenvolver sistemas interativos em tempo real para as artes e também frequenta espaços Makers, colaborando e compartilhando seus conhecimentos em tecnologias.<rodrigo.rez@gmail.com>",
    "foto": "https://drive.google.com/file/d/1meQo9Oe5030AVpbs31typHY0eokajwz8/view?usp=sharing\n\nhttps://drive.google.com/file/d/13aZWYjG8e4oVjX165SUVgkBP1u7QNxEq/view?usp=sharing\n\nhttps://drive.google.com/file/d/10Ro-WjTfRdlrKNf4btbbroamE3zaLDpE/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=Mmh1OTBhMGI0YzIydXVrdWM2aGgxcmJyZmcgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "17:00",
    "duracao": "1 hora",
    "tipo": "workshop",
    "titulo": "Interagindo Processing com PureData usando Open Sound Control",
    "proponente": "Tiago Fernandes Tavares",
    "descricao": "Muitas vezes queremos fazer a arte visual interagir com a arte sonora, e é difícil encontrar ferramentas que contemplem as duas coisas. Então, a solução é fazer ferramentas diferentes conversarem entre si. Nesta oficina, vou explicar como fazer Processing conversar com PureData usando mensagens no protocolo Open Sound Control (OSC). Isso permite fazer sons controlados pelas dinâmicas caóticas que podemos fazer no Processing, ou, talvez, usar sons para controlar dinâmicas visuais. A oficina será ministrada online, e quem quiser participar interativamente já deve ter o Processing e o PureData instalados previamente (http://processing.org/ - eu uso a versão java / https://puredata.info/ - eu uso a versão PurrData (ou pd2lork) ). Vou abrir um canal no Hamachi também, para podermos interagir com sketches e patches diretamente pela web.",
    "publico": "todos os públicos",
    "vagas": "100",
    "requisitos": "Para quem quiser acompanhar interativamente, instalar o Processing e o PureData.",
    "minibio": "Tiago faz pesquisa em processamento digital de sinais e aprendizado de máquina na busca por novas maneiras de interagir com a música.",
    "foto": "https://timba.nics.unicamp.br/~tiagoft/wp-content/uploads/2020/11/foto-perfil-novo.png",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=N2pvY205Zm9yYTduNnEwaWhxYjQ1azdrcnIgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "dom. 11/04",
    "horario": "17:00",
    "duracao": "30 minutos",
    "tipo": "palestra",
    "titulo": "INTERREGNO - Metodologia de Design para Instalações interativas",
    "proponente": "Felipe Salazar",
    "descricao": "Através da apresentação do projeto INTERREGNO, realizada em 2017, o objetivo da apresentação é se aprofundar na metodologia de design utiliazada no desenvolvimento da instalação durante os 6 meses de projeto. Marcando seus desafios, avanços e estratégias criativas, é possível traçar uma jornada para que futuros artistas digitais inspirem-se a unir o planejamento a um processo experimental e colaborativo.",
    "publico": "programadores com alguma prática ou experientes",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Felipe Faillace Salazar é um designer digital envolvido com a estratégia e a implementação de soluções criativas e tecnológicas a partir da colaboração e do design thinking. Formado em Design de Mídias Digitais na PUC-Rio, onde também fundou o Coletivo Trama, uma iniciativa colaborativa de ocupação de espaços públicos que atuou de 2014 a 2018 no Rio de Janeiro. Trabalhou no Laboratório de Inovação da Oi S.A. como Designer de Serviço e como Product Owner no Appzinho, startup digital imobiliária no Rio de Janeiro. Atualmente, morando em Lisboa fundou o Studio Venturas, um estúdio de design que oferece soluções digitais para empreendedores, artistas e pequenos negócios. Enquanto isso, está cursando o mestrado em Arte Multimédia na Faculdade de Belas Artes da Universidade de Lisboa, com ênfase em Artes Interativas.",
    "foto": "https://felipefsalazar.cc/wp-content/uploads/2020/06/brasilia2017.png",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MmQxOXRoODJwNHVqYTJiOGRmM2htNGEyanIgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "2",
    "data": "seg. 12/04",
    "horario": "19:00",
    "duracao": "1 hora e 30 minutos",
    "tipo": "workshop",
    "titulo": "Workshop de padronagens generativas",
    "proponente": "Barbara Castro",
    "descricao": "Um workshop de introdução à programação criativa utilizando p5.js na plataforma OpenProcessing. Vamos criar padrões e estampas geradas dinamicamente. O workshop vai partir das formas geométricas básicas e irá abordar conceitos como iteração, transformação e funções customizadas.",
    "publico": "iniciantes",
    "vagas": "14",
    "requisitos": null,
    "minibio": "Barbara Castro é artista-programadora, designer, pesquisadora e professora. Sua atuação teórico-prática se concentra nos campos da arte computacional com ênfase em visualização artística de dados. É doutora em Artes Visuais pela EBA/UFRJ e professora da PUC-Rio onde leciona em disciplinas sobre projetos socioambientais, culturas regenerativas e sobre o desenvolvimento sustentável, crítico e criativo de novas tecnologias. É sócia fundadora e diretora de criação do estúdio Ambos&& que realiza instalações interativas, exposições, curadorias e consultoria criativa para museus como Museu do Amanhã, Oi Futuro, Museu de Arte do Rio, Centro Cultural Banco do Brasil e para instituições como BNDES, SESC e SENAI. Entre seus trabalhos recentes se destacam a co-idealização da exposição e do livro Existência Numérica no Oi Futuro. Em 2019, Barbara foi co-curadora da exposição Data Corpus junto com equipe da Casa Firjan.",
    "foto": "https://media-exp1.licdn.com/dms/image/C4D03AQEE26thD-WGtA/profile-displayphoto-shrink_800_800/0/1586446604938?e=1620259200&v=beta&t=QXxTc61D95jfy7jySn4AnowsREE3yM37OTiUwLvy1OY",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MmdjYTJzcmU2YzQ0cTFqbDI0ZGZjbW0wb2Qgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "3",
    "data": "ter. 13/04",
    "horario": "19:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Estamparia Têxtil com Design Gerativo",
    "proponente": "Monica Rizzolli",
    "descricao": "No workshop “Design Gerativo para Estamparia Têxtil”, a artista-programadora Monica Rizzolli apresenta seu trabalho com programação, fala um pouco sobre sua experiência artística, seu repertório e principalmente quais são as possíveis aplicações de procedimentos gerativos e linguagens como o Processing, nas artes têxteis, estamparia e design de moda. Descobriremos também as ferramentamentas e maquinários que podem ser utilizados para a impressão das estampas criadas algoritmicamente, e por último, teremos uma introdução ao Processing, seguida de um exercício prático de construção de uma estampa digital sem repetição usando um algoritmo de Wave Function Collapse algorithm.\n\nDinâmica do workshop:\nAtividade 01: Apresentação, influências e referências.\nAtividade 02: O que são procedimentos gerativos, como podem ser utilizados na elaboração de estampas, e quais são suas peculiaridades em relação a outros métodos de criação de estampas. Como os estampas podem ser impressas.\nAtividade 03: O que é Processing? O que é um algoritmo? \nAtividade 04: Exercício prático de elaboração de um motivo a ser utilzado em um algoritmo de Wave Function Collapse, seguido da exportação em PDF da estampa e sua impressão {opcional).",
    "publico": "iniciantes",
    "vagas": "20",
    "requisitos": "Ter o software Processing instalado",
    "minibio": "Monica Rizzolli é artista-programadora, estudou no Instituto de Artes da UNESP e na Kunsthochschule Kassel (Alemanha). Participou de projetos internacionais como MAK Center Artists and Architects (EUA), Creatives in Residence (China), Sweet Home (Espanha) e A.I.R. DRAWinternational (França). Recebeu o prêmio MAK Schindler, do MAK - Museum of Applied Arts Vienna. É co-fundadora da Noite de Processing e co-organizadora do Processing Community Day São Paulo de 2019, evento anual da Processing Foundation. Com Tony de Marco é sócia da type foundry Just in Type e do estúdio de design Contrast - programação, tipografia e design.",
    "foto": "https://drive.google.com/file/d/1abkSefOMHNb7HqEliw43Nw47Zz3sxX8m/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MHU0dDhibDFvdHV2cmtiOGVrM3MxZzFqOTMgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "4",
    "data": "qua. 14/04",
    "horario": "19:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Construção de artigos misturados com livecode através do Observable",
    "proponente": "Guilherme Ranoya e Claudio Esperança",
    "descricao": "A ideia é apresentar a plataforma Observable para desenvolvimento de cadernos de notas (notebooks) interativos. As principais características da plataforma serão apresentadas passo-a-passo, mescladas com atividades práticas. A ideia é dividir o workshop em pelo menos 2 segmentos expositivos de meia hora, com uma ou duas atividades práticas de 10 a 15 minutos. Espera-se que o público alvo possua noções de HTML e ao menos uma linguagem de programação - JavaScript, de preferência. Conhecimento de Processing e/ou p5.js é amplamente suficiente.",
    "publico": "todos os públicos",
    "vagas": "100",
    "requisitos": null,
    "minibio": "Guilherme Ranoya e Claudio Esperança são professores das universidades UFPE e UFRJ, e ambos trabalham com visualização de dados e programação como suporte das visualidades gráficas.\n\nClaudio Esperança é professor titular do Programa de Engenharia de Sistemas e Computação da COPPE/UFRJ. Desenvolve atividades de ensino e pesquisa em Computação Gráfica desde 1990. Observable Ambassador.\n\nGuilherme Ranoya é professor e pesquisador do departamento de design (dDesign) da Universidade Federal de Pernambuco (UFPE). Líder do grupo de pesquisa integrada em design e computação (D+C), e membro dos grupos de pesquisa em experimentação e inovação em arte, tecnologia e criatividade (MusTIC), do grupo de pesquisa em design da informação (DI/PPGDesign) e do consórcio de pesquisa realmente aplicada em inteligência artificial (PRAIA).",
    "foto": "https://www.ranoya.com/Assets/pessoas/tRanoya.png\n\nhttps://labvis.eba.ufrj.br/wp-content/uploads/2016/11/claudio-e.png",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MXEyN2ZraGNnbGlucGxkamp0dWVlNDVtYzcgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "5",
    "data": "qui. 15/04",
    "horario": "19:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Uma outra prática de caligrafia.",
    "proponente": "Mariana Leal",
    "descricao": "Pegaremos o script gerado em uma noite de processing (https://github.com/arteprog/Glifos) e usaremos como ponto de partida para uma prática diferente de caligrafia. Como numa aula normal, copiaremos exemplos de glifos, só que neste caso os exemplos serão resultados desse script, e não letras do alfabeto latino. \n\nSerão abordados os conceitos introdutórios da caligrafia - contraste por translação, ductus que formam o glifo etc - mas eles serão aplicados na prática destes glifos asêmicos.\n\nO objetivo da oficina é desenvolver uma consciência do gestual da caligrafia que não esteja condicionada por nenhum trajeto pré-concebido como ocorre com as letras latinas. E ele será facilitado, é claro, por um programa escrito no processing.",
    "publico": "iniciantes",
    "vagas": "15",
    "requisitos": "É aconselhável os participantes acessarem a oficina por dois dispositivos. Um para me observar demonstrando as letras e outro para eles filmarem eles próprios praticando, para eu observar a técnica deles e aconselhar melhoras.\n\nMateriais necessários para participar da oficina: \npena caligráfica de ponta quadrada - qualquer modelo (se não tem, tutorial para produção: https://www.instagram.com/p/CIvSPNCgm67/);\npapel cartolina ou canson - mínimo tamanho A3;\nrégua, lápis, borracha;\naquarela líquida ou guache bem diluído;",
    "minibio": "Mariana Leal é calígrafa e arte-programadora residente em São Paulo. Suas pesquisas atuais consistem na expansão dos gestos caligráficos para além dos seus suportes habituais. Para tal, ela usa também o processing e a programação. Ministra cursos sobre caligrafia, com ou sem programação, desde 2019. Portfolio: https://marileal.github.io/ Rede social: instagram.com/lightesthand",
    "foto": "https://github.com/Marileal/Marileal.github.io/blob/main/imagens/IMG_20200414_175810200(1).jpg",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=Mms3ZW9hNTY2Z2E0MWVpNDl0MXNiaTNhcW4gcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "6",
    "data": "sex. 16/04",
    "horario": "15:00",
    "duracao": "2 horas",
    "tipo": "debate",
    "titulo": "Encontro inaugural da rede de cooperação e colaboração acadêmica em criatividade computacional e programação criativa",
    "proponente": "Guilherme Ranoya",
    "descricao": "A atividade será um encontro direcionado para professores, pesquisadores e estudantes das áreas de programação criativa, tecnologias criativas ou programação criativa, com o intuito de discutir a formação de uma rede de colaboração acadêmica na área.",
    "publico": "todos os públicos",
    "vagas": "100",
    "requisitos": null,
    "minibio": "Professor e pesquisador do departamento de design (dDesign) da Universidade Federal de Pernambuco (UFPE). Lider do grupo de pesquisa integrada em design e computação (D+C), e membro dos grupos de pesquisa em experimentação e inovação em arte, tecnologia e criatividade (MusTIC), do grupo de pesquisa em design da informação (DI/PPGDesign) e do consórcio de pesquisa realmente aplicada em inteligência artificial (PRAIA).",
    "foto": "https://www.ranoya.com/Assets/pessoas/tRanoya.png",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NThzMTNob3ZqaXE5b2lsajZwajhzdG84Z2kgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "6",
    "data": "sex. 16/04",
    "horario": "17:30",
    "duracao": "30 minutos",
    "tipo": "performance",
    "titulo": "04_3RT014",
    "proponente": "Nicolau Centola",
    "descricao": "04_3RT014 é uma webperformance audiovisual (Vjing). Tem como base o projeto musical oPróprioEsquerdo, uma série de improvisações livres utilizando presets de uma drum machine Roland MC-505. A partir desta base sonora, serão criadas, em tempo real, interações visuais em Processing no ambiente de live coding Visor.",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Nicolau Centola é doutor pelo Instituto de Artes da Unesp, com pesquisa sobre a questão do acaso e espacialização na arte sonora. Suas produções exploram as relações entre paisagens sonoras, espaço e percepção. Participou de exposições em diversas cidades do Brasil e em Colônia (Alemanha), Londres (Inglaterra), Linz (Áustria) e Arad (Romênia).",
    "foto": "https://drive.google.com/file/d/1pFKHkfwPAd5TERY4SWv4lLg08KXq_ocS/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=N3RpN2Ewbm1pMTZmN3ZudDQ0azkxN2RhMTUgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "6",
    "data": "sex. 16/04",
    "horario": "18:00",
    "duracao": "1 hora",
    "tipo": "performance",
    "titulo": "Byte sobre óleo sobre tela",
    "proponente": "Artur Cordeiro",
    "descricao": "O projeto Byte sobre óleo sobre tela é uma \"action paiting\" maquínica executada pela CNC Zyxbot, a partir de código gerado no Processing, resultando em uma pintura a óleo em uma tela de 20x30cm. O algoritmo sorteia tamanhos de traços, profundidade do pincel e cores, gerando um G-code, que será enviado para a CNC. A Zyxbot terá um pincel no cabeçote, e cinco tons e cores de tintas, que serão escolhidas de acordo com as definições do código. A performance Byte sobre óleo sobre tela será exibida em tempo real, da geração do G-code até a pintura da tela. Como uma ação experimental, o projeto tensiona os ruídos na relação do código e materialidade, do comando numérico traduzido em movimento do pincel, investigando um modo tangível de manipulação do desenho algorítmico.",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Artur Cordeiro é doutor pela Faculdade de Arquitetura e Urbanismo da Universidade de São Paulo com pesquisa sobre mídia arquitetura e formas participativas. Em 2019 participou como pesquisador visitante no Lectorate of Play & Civic Media da Faculty of Digital Media and Creative Industries na Amsterdam University of Applied Sciences. Trabalhou na Prefeitura de São Paulo, colaborando na implementação da Rede Pública de Laboratórios de Fabricação Digital, Fab Lab Livre SP. Atualmente desenvolve projetos lúdicos, de sensoriamento ambiental e experimentos com tecnologias abertas, fabricação digital, leds piscantes e coisas sonoras.",
    "foto": "https://drive.google.com/file/d/1fUo42DfwcvIq6JAEd9qGPn90_Q8CLZis/view",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MXVnMHBrbWw2aHM1ZTU0cTMxNTNidXNzNDggcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "6",
    "data": "sex. 16/04",
    "horario": "19:00",
    "duracao": "30 minutos",
    "tipo": "performance",
    "titulo": "CosmoVisões Fractais",
    "proponente": "Pablo Villa & Fabricio Masutti",
    "descricao": "A performance consiste em um percurso audiovisual utilizando o banco de dados de animações criadas em processing, que são sincronizadas (apesar da possibilidade de delays e erros) ao som de um baixo sintetizado com pedais criados por um dos artistas. As animações consistem em simples estudos, rascunhos feitos através de apropriações de códigos alheios, de modo a se extrair formas, cores e sensações inesperadas, transcendentes e erráticas. As animações são mixadas com alguns gifs e fotos com um tom mais naturalista, são momentos efêmeros que podem ser transcendidos por meio da geometria. O objetivo é criar sensações audiovisuais singulares e buscar possíveis sentidos em meio ao fluxo quase aleatório de signos visuais. E criar conexões ou choques entre as camadas de imagens mais abstratas (animações) em relação às mais ou menos figurativas (gifs e fotos).\nDuração: 20 min",
    "publico": "artistas, designers e programadores iniciantes ou com alguma prática",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Professor adjunto na Universidade Federal da Integração Latino-Americana (UNILA, 2017), no curso de Cinema e Audiovisual e Artista visual. Doutor em Comunicação e Semiótica (PUC-SP), desde de 2015, sob orientação da profª. Dra. Lucia Leão. Título da pesquisa: Cineinstalações e o processo de criação no atravessamento dos espaços em ambientes audiovisuais e interativos: uma cartografia de poéticas experimentais. No período de doutorado foi bolsista integral da Capes durante 3 anos. É pesquisador do grupo Comunicação e Criação nas Mídias, coordenado pela profª Lucia Leão (CNPq). É mestre em Comunicação e Semiótica, tendo realizado a dissertação: A construção do tempo no diálogo entre cinema e vídeo, sob orientação da Profª. Dra. Lucrécia D. Ferrara ( 2009). É especialista em Criação de Imagem e Som em Meios Eletrônicos, pelo centro universitário SENAC-SP (2006), e graduado em Publicidade e Propaganda pela Universidade de Franca (2001). Foi professor na universidade FMU/FIAM-SP, nos cursos de produção audiovisual e Rádio e Televisão (2009- 2012), e no curso livre de audiovisual do SENAC-SP (2009-2010). Realizou produções audiovisuais como editor de imagens. É artista visual, atualmente concebe instalações audiovisuais interativas ou não, algumas obras são: In(Out)Side exibida no evento Zonas de Compensação, Instituto de Artes da Unesp, São Paulo (2014), colaborou com a obra Dividing Lines, do grupo Marshmallow Laser Feast, e, realizou a instalação Amarelinha Digital ( 2017, no Sesi-SP) e Amarelinha Digital Caracol (2020, Ecomuseu).",
    "foto": "https://drive.google.com/drive/folders/1KBdFMV0JEEuJYa4UBefgf2GkKGcEXjWW?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MjdnZDVnMnVsYWtoaDVqNWtiZHNlMGM2NTEgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "6",
    "data": "sex. 16/04",
    "horario": "19:30",
    "duracao": "1 hora",
    "tipo": "workshop",
    "titulo": "desenho por equações",
    "proponente": "Rodrigo Rezende & Dhuba",
    "descricao": "Processing é uma linguagem voltada para artes e desta forma se aproxima de alguma forma da linguagem humana facilitando nossa vida na geração de códigos de programação. Por outro lado como toda linguagem de programação de alto nivel, não deixa visível as equações que compõem seu resultado grafico. Desenho com equações, procura demonstrar de forma pratica como essas equações podem também gerar formas das simples as mais complexas através do Processing.",
    "publico": "programadores iniciantes e com alguma prática",
    "vagas": "100",
    "requisitos": null,
    "minibio": "Rodrigo Rezende é mestrando em Artes Visuais na Unesp e graduado em Jogos Digitais na Faculdade Impacta de Tecnologia. Atua como Artista e Programador no Coletivo RE(C)organize e desenvolve pesquisas de interatividade em arte e computação física com software e hardware livres. Atua como multiplicador de conhecimento, através de oficinas nas áreas de multimídia, arte computacional e audiovisual. Pesquisa junto ao grupo GIIP do Instituto de Artes da Unesp, as relações entre arte, ciência e tecnologia, além de desenvolver sistemas interativos em tempo real para as artes. Realizou trabalhos em Barcelona, Sevilha e Mérida, na Espanha durante sua residência naquele país e também frequenta espaços Makers, colaborando e compartilhando seus conhecimentos.\n\nEduardo Affonso, Dhuba, é formado em física. Trabalhando com arte e tecnologia (2D, 3D, áudio, vídeo, animação, archviz, design e jogos) com foco principal em artes interativas.",
    "foto": "https://drive.google.com/drive/folders/1OnVtRAgI-uxY2l9jGTzy-YECojNo5x_Z?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MDI4bG9vNG85ZHB0NWVnOXQ0NHZjcGdkOGcgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "09:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Criação visual a partir de funções matemáticas",
    "proponente": "Marlon Tenório",
    "descricao": "A oficina possui dois momentos: \nNo primeiro, veremos como criar gráficos de funções matemáticas elementares usando a biblioteca de javascript p5;\nNo segundo momento exploraremos esses gráficos de forma criativa, trabalhando com animações e interações.",
    "publico": "iniciantes",
    "vagas": "15",
    "requisitos": "A oficina usará o editor online ofertado pelos desenvolvedores de p5js. Os interessados deverão ter acesso ao editor, preferencialmente usando um computador (desktop ou laptop) com acesso à internet",
    "minibio": "Designer formado pela Universidade do Estado da Bahia. Também é ilustrador e vem estudando o uso de técnicas de programação criativa (especialmente p5js) para geração de imagens estáticas e animações. Mantém o perfil codingp5, no Instagram, onde divulga o resultado dos estudos, bem como apresenta conceitos e fundamentos da biblioteca p5js.",
    "foto": "http://marlontenorio.com/image/marlontenorio.jpg",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NXFtbWRmbXE5Z3RnY2tyamU3c2wxc3RybGkgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "10:00",
    "duracao": "1 hora",
    "tipo": "palestra",
    "titulo": "Programas designers",
    "proponente": "André Burnier",
    "descricao": "Nessa palestra Burnier vai compartilhar sua pesquisa sobre o desenvolvimento de ferramentas que fazem design - programas designers.\nTodo designer é um programador. Um manual de identidade visual, por exemplo, é um programa - escrito por designers, para outros designers lerem. Será que podemos traduzir identidades visuais em programas que geram layouts, programas designers? O designer humano cria o designer bot, que gera o layout. Quem é o designer então? Nós, ou o programa?",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": null,
    "minibio": "André Burnier atua como designer gráfico, programador criativo e professor. Em 2016 se formou Mestre em Design Gráfico pela AKV | St. Joost, na Holanda, e dês de então desenvolve uma pesquisa sobre a intersecção entre design e programação. Durante essa pesquisa prática, Burnier explora o design generativo com desenvolvimento de ferramentas para fazer design – designer bots.",
    "foto": "http://www.andreburnier.com/arquivos/retratos/andre_burnier_filtro.jpg",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=N2x1azJzbnVuM2Z1azN0aTRqYzlndWdwaDMgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "11:00",
    "duracao": "2 horas",
    "tipo": "sprint",
    "titulo": "pyp5js",
    "proponente": "Bernardo Fontes (Berin)",
    "descricao": "O pyp5js é uma projeto que criei para permitir as pessoas a praticarem a programação criativa no navegador mas utilizando Python ao invés de Javascript e p5.js. Nesta atividade, gostaria de apresentar o projeto, sua história, discutir issues e abrir para a colaboração de pessoas da comunidade. Penso que existem 2 tipos de contribuições possíveis e que, dessa forma, tornam o sprint mais acessível para pessoas não programadoras:\n\n1.  Contribuir com o projeto aumentando a galeria de exemplos - nesse caso as pessoas seriam convidadas a fazerem um fork do projeto, rodarem nas suas máquinas e abrirem um pull request adicionando um novo exemplo. Penso que esse processo também pode ser bom para pessoas sem familiaridades com o git e github poderem experimentar e se aproximarem do processo;\n\n2. Contribuir com o projeto resolvendo bugs ou adicionando features - aqui já é um formato de contribuição mais tradicional do fazer software livre.",
    "publico": "programadores com alguma prática",
    "vagas": "30",
    "requisitos": null,
    "minibio": "Cientista da Computação pela UFF, explorador de um fazer minimalista e processual. Promove arte generativa livre em berinhard.github.io/sketches; criador do projeto pyp5js; assina registros musicais e de programação criativa como berin, 2bonsai e filhos de um acaso gravitacional. Também é um dos criadores do coletivo pessoas.cc e, durante 2019, organizou a Noite de Processing em Recife. Em 2018 atuou no projeto Outra 33ª Bienal de São Paulo, e, em 2020, no Exch w/ Turkers, que evidencia o papel de humanos nas IAs, ambos em parceria com o artista Bruno Moreschi; integrante do duo de live coding Pietro Bapthysthe com apresentações em EulerRoom Equinox 2020, Algovoids, Network Music Festival, Algorave Brasil 2020 e outros.",
    "foto": "https://avatars.githubusercontent.com/u/238223?s=460&u=a24e47a16ecccb1b66b92f32b4b5781908d6ea61&v=4",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NzVva3Y1YWEwOTVrc2hidDBkZnI0dW8zMjUgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "11:00",
    "duracao": "1 hora",
    "tipo": "showcase",
    "titulo": "Showcase Grupo Realidades ECA USP",
    "proponente": "Grupo Realidades",
    "descricao": "O grupo de pesquisa Realidades (ECA USP) apresenta sua produção artística dos últimos 11 anos, discutindo o uso da plataforma Processing em seus processos criativos. Será apresentada uma cronologia de instalações interativas, objetos, interfaces e realidade aumentada, seus conceitos e técnicas, demonstrando diferentes usos da plataforma Processing em contexto acadêmico e artístico de uma universidade brasileira.",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": null,
    "minibio": "O Grupo de Pesquisa Realidades (ECA USP) investiga o diálogo entre Arte, Ciência e Tecnologia, tanto num retorno aos acontecimentos relevantes para compreender seu percurso histórico e modos de desenvolvimento, quanto no embate crítico com o presente, através da análise da paisagem midiática contemporânea, observando os processos de linguagem envolvidos, e aqueles ligados aos processos mais amplos da sociedade. Esta investigação é conduzida por meio da discussão dos aspectos conceituais dos problemas que surgem na área, assim como pelo desenvolvimento de projetos práticos em que se exploram as poéticas decorrentes deste contexto. O grupo foi fundado em 2010 e é coordenado pela Profª Drª Silvia Laurentiz.",
    "foto": "https://drive.google.com/file/d/1xoEwv88Wmrtx9pD_WuEWBZUpiDTLIrY5/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=N2RzMDMzZmMzdDZlMWp0NnQ5MHMxN2VjMWggcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "14:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Machine Learning para Curiosos",
    "proponente": "Sergio Venancio",
    "descricao": "Neste workshop aprenderemos como funciona um processo básico de Machine Learning (Aprendizado de Máquina) de forma prática, utilizando ferramentas web como Teachable Machine, ML5js e P5js. Estas ferramentas permitem a criação e uso de modelos que reconhecem padrões em imagens e sons, gerando novos tipos interações como detecção de expressões faciais e posições corporais, ou reconhecimento de comandos de voz. Como experimento prático, controlaremos um jogo a partir de webcam, utilizando gestos ou desenhos. Primeiro criaremos conjuntos de dados para um processo de aprendizado supervisionado. Depois treinaremos modelos classificadores a partir desses dados, que serão testados e refinados até atingirem boa performance. Finalmente, exportaremos nossos modelos para controlarem um jogo na web.",
    "publico": "todos os públicos",
    "vagas": "20",
    "requisitos": "Ter um computador de configurações razoáveis, com webcam e microfone, conectado à internet e com navegador moderno para trabalhar com as seguintes ferramentas:\n- https://teachablemachine.withgoogle.com/ + conta no Google Drive para salvar projetos\n- https://editor.p5js.org/ + conta na plataforma para salvar seus códigos",
    "minibio": "Sergio Venancio é artista, programador, pesquisador e professor. Suas pesquisas e produções se encontram na intersecção entre Artes e Inteligências Artificiais. É doutorando pelo Programa de Pós-Graduação em Artes Visuais (PPGAV) ECA USP, mestre em Artes Visuais pela mesma instituição. Graduado em Artes Visuais e em Ciência da Computação pela UNICAMP. Leciona nos cursos de Especialização em Design Gráfico UNICAMP, e Pós-Graduação em Arquitetura Digital e Projetos Paramétricos na Belas Artes SP. Participa do grupo Realidades (ECA USP) e coletivo COM.6, pelos quais já participou de exposições e festivais nacionais e internacionais com instalações interativas.",
    "foto": "https://drive.google.com/file/d/1a5qs5Ycxs3d1sQy9bRnRfF_r69tHKI19/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NWQyZm91Ympua3V0NW84bWhjaThpcmxzbjcgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "14:00",
    "duracao": "1 hora",
    "tipo": "palestra",
    "titulo": "Cupins, Biologia e Ensino Médio",
    "proponente": "Vinícius Barros Rodrigues",
    "descricao": "O objetivo desta palestra é apresentar o uso do Processing em áreas como a biologia e a ecologia. Também vou compartilhar alguns projetos que estão em desenolvimento, buscando englobar biologia e programação no ensino médio.",
    "publico": "todos os públicos",
    "vagas": "live",
    "requisitos": null,
    "minibio": "Biólogo com interesse em simulações ecológicas e muita curiosidade em Processing. Doutor em Entomologia pela Universidade Federal de Viçosa, com período sanduíche no Center for Biorobotics na Syddansk Universitet (Odense, Dinamarca). Atualmente é professor de robótica e biologia para o ensino médio.",
    "foto": "https://avatars.githubusercontent.com/u/12240167?s=460&u=3959147e97ab31d02a8a1df4b03f8e711808ffe4&v=4",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NGx1Z2MxdGQ2Z2JwMjFqMGJibWFyM2lxN2ogcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "16:00",
    "duracao": "1 hora",
    "tipo": "workshop",
    "titulo": "C & SDL para Processeiros",
    "proponente": "João Antonio Ferreira",
    "descricao": "Pergunta-se muito sobre linguagens e plataformas para se aprender depois do Processing. Enquanto o processing não deixa de ser uma ferramenta bem adequada em diversos contextos profissionais, existem, claro, varias razões para se migrar para outras ferramentas.\nO C é o latim da programação moderna, a grande maioria das linguagens mais usadas hoje deriva a sua sintaxe de lá. Mas, ao contrário do latim, o C retém sua posição até hoje como um industry standard para aplicações de alta performance. Esse status pode deixar o explorador da programação um tanto intimidado. Na verdade hoje não há tantas barreiras para aprender e usar o C de modo tão dinâmico e criativo quanto usamos os processing.",
    "publico": "programadores experientes",
    "vagas": "100",
    "requisitos": null,
    "minibio": "João Antonio programa coisas desde 2013 mas já existia desde 1991. Confira seu portfólio, https://introscopia.github.io/",
    "foto": "https://introscopia.github.io/images/Planetarium%20Ribboneer%202018-4-26%20%2022.12.50.png",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=MzdjaDNwbnFqbG9vNGN0bHJ0cTltM2k2cDMgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "7",
    "data": "sáb. 17/04",
    "horario": "16:00",
    "duracao": "2 horas",
    "tipo": "codejam",
    "titulo": "Desembrulhando o Paper.js",
    "proponente": "Rodrigo Junqueira (RodJun)",
    "descricao": "Em um ambiente colaborativo, pretendo conduzir um CodeJam com interessados em explorar o framework Paper.js, com que venho desenvolvendo trabalhos recentemente. Paper.js é um framework open source que roda em cima de um Canvas em HTML5. Ele oferece uma plataforma rica em recursos para criação e manipulação de vetores gráficos e curvas de bezier.",
    "publico": "todos os públicos",
    "vagas": "5",
    "requisitos": null,
    "minibio": "Rodrigo Junqueira (ou RodJun) é programador, fotógrafo, estudante de design gráfico, e encontrou-se na programação criativa (https://rodjun.com). Atualmente explora as fronteiras entre o creative coding e sua o design gráfico.",
    "foto": "https://rodjun.com/images/me.jpg",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=M3NiajhsdDFjNHV1azk5dGZrZWc0Y2VxdTcgcm85a2JzczhrZGE4YTRhbHBnZXBhNWhiM3NAZw&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com",
    "urlInscricao": "em breve"
  },
  {
    "diaEvento": "1",
    "data": "todos os dias, de 11 a 17/04",
    "horario": "19:00",
    "duracao": "2 horas",
    "tipo": "workshop",
    "titulo": "Integração audiovisual via protocolo OSC com Processing e Pure Data",
    "proponente": "Vinícius Fernandes",
    "descricao": "Pure Data(PD) é uma linguagem visual de programação, baseada em diagramas que ilustram fluxos de dados, open-source e dedicada em grande medida a aplicações de áudio.\nEsta atividade abordará aspectos gerais da sintaxe do programa, além de exercícios práticos de programação de áudio, para integrá-lo ao Processing , aproveitando o que cada programa oferece de melhor para criar sistemas audiovisuais generativos e responsivos à interação de usuários. A implementação desta interface será feita via protocolo OSC (Open Sound Control), portanto, também focaremos nossa atenção em entender como funciona a comunicação em tal protocolo.\nEsta atividade tem duração de 7 dias. Será ministrada online das 19h00 às 21h00.\n\nConteúdo programático\n\n1º módulo - Pure Data\n\n - Representação digital do som \n - Taxa de amostragem\n - Bitdepth\n - Programação e sintaxe do Pure Data\n - Osciladores e Formas de Onda\n - Técnicas de modulação: LFO, AM, PWM, FM\n - Sequenciadores\n - MIDI no Pure Data\n - Envelopes\n - Filtros\n\n2º módulo - Processing\n\n- Sintaxe do Processing\n- Expressões Booleanas\n- Loops\n- Funções e Objetos\n- Programação orientada a objetos\n- Array\n- Imagem e video\n\n3º módulo - Protocolo OSC e Algoritmos generativos\n- Estrutura do protocolo OSC\n- Integração entre Pure Data e Processing\n- Cadeia de Markov\n- Random\n- Perlin Noise\n- Fractais\n- Estratégias de composição musical generativa\n- Sonificação",
    "publico": "programadores com alguma prática ou experientes",
    "vagas": "25",
    "requisitos": "Os participantes devem ter acesso a um computador que possa produzir gráficos e som e com internet.",
    "minibio": "Vinicius Fernandes é músico, desenvolvedor e pesquisador. Graduado em estudo literários pela UNICAMP e mestre em sonologia pela USP. É criador de Menis - síntese e Processamento Lo-Fi e atua ministrando cursos de eletrônica com foco em construção de instrumentos musicais de baixo custo. Apresentou-se em concertos de música experimental e congressos em diversos países como Alemanha, Itália, Espanha, Lituânia, Estônia, Letônia etc",
    "foto": "https://drive.google.com/file/d/16rJVdSRhQMIP285Ic7E24_v-Mk_SI5mw/view?usp=sharing",
    "urlCalendar": "https://calendar.google.com/event?action=TEMPLATE&tmeid=NnBsNmpmb2VwdmFxZ2VjdDY4OTU2bmwyZ3BfMjAyMTA0MTFUMjIwMDAwWiBybzlrYnNzOGtkYThhNGFscGdlcGE1aGIzc0Bn&tmsrc=ro9kbss8kda8a4alpgepa5hb3s%40group.calendar.google.com&scp=ALL",
    "urlInscricao": "em breve"
  }
]